; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-2-23)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-3 - location
	p0-4 - location
	p1-0 - location
	p1-2 - location
	p2-4 - location
	p3-4 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s4)
	(at driver3 s0)
	(at driver4 s3)
	(at driver5 s3)
	(at driver6 s3)
	(at driver7 s0)
	(at driver8 s3)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at package1 s0)
	(at package2 s2)
	(at package3 s1)
	(at package4 s0)
	(at package5 s1)
	(at package6 s1)
	(at package7 s2)
	(at package8 s2)
	(at package9 s0)
	(at package10 s0)
	(at package11 s2)
	(at package12 s0)
	(at package13 s2)
	(at package14 s2)
	(at package15 s3)
	(at package16 s1)
	(at package17 s2)
	(at package18 s4)
	(at package19 s0)
	(at package20 s3)
	(at package21 s1)
	(at package22 s0)
	(at package23 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(link s0 s1)
	(link s1 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s4 s0)
	(link s0 s4)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s4)
	(at driver3 s3)
	(at driver8 s3)
	(at truck2 s0)
	(at package1 s1)
	(at package2 s1)
	(at package4 s4)
	(at package5 s2)
	(at package7 s1)
	(at package8 s0)
	(at package9 s4)
	(at package10 s4)
	(at package11 s0)
	(at package12 s3)
	(at package13 s0)
	(at package14 s0)
	(at package15 s2)
	(at package16 s3)
	(at package17 s0)
	(at package18 s3)
	(at package19 s3)
	(at package20 s4)
	(at package21 s1)
	(at package22 s2)
	(at package23 s4)
	))


)

; plan
1. (board-truck driver6 s3 truck1)
   deleted: (at driver6 s3) (empty truck1)
   added: (driving driver6 truck1)
   goals met: 5 of 26
2. (drive-truck driver6 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 5 of 26
3. (load-truck s2 package8 truck1)
   deleted: (at package8 s2)
   added: (in package8 truck1)
   goals met: 5 of 26
4. (load-truck s2 package7 truck1)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   goals met: 5 of 26
5. (load-truck s2 package23 truck1)
   deleted: (at package23 s2)
   added: (in package23 truck1)
   goals met: 5 of 26
6. (drive-truck driver6 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 5 of 26
7. (load-truck s0 package9 truck1)
   deleted: (at package9 s0)
   added: (in package9 truck1)
   goals met: 5 of 26
8. (unload-truck s0 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s0)
   goals met: 6 of 26
9. (drive-truck driver6 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 6 of 26
10. (load-truck s2 package2 truck1)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 6 of 26
11. (load-truck s2 package17 truck1)
   deleted: (at package17 s2)
   added: (in package17 truck1)
   goals met: 6 of 26
12. (drive-truck driver6 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 6 of 26
13. (load-truck s0 package4 truck1)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   goals met: 6 of 26
14. (load-truck s0 package22 truck1)
   deleted: (at package22 s0)
   added: (in package22 truck1)
   goals met: 6 of 26
15. (drive-truck driver6 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 6 of 26
16. (unload-truck s2 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s2)
   goals met: 7 of 26
17. (load-truck s2 package14 truck1)
   deleted: (at package14 s2)
   added: (in package14 truck1)
   goals met: 7 of 26
18. (drive-truck driver6 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 7 of 26
19. (load-truck s0 package19 truck1)
   deleted: (at package19 s0)
   added: (in package19 truck1)
   goals met: 7 of 26
20. (unload-truck s0 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s0)
   goals met: 8 of 26
21. (drive-truck driver6 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 8 of 26
22. (load-truck s2 package13 truck1)
   deleted: (at package13 s2)
   added: (in package13 truck1)
   goals met: 8 of 26
23. (drive-truck driver6 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 8 of 26
24. (unload-truck s0 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s0)
   goals met: 9 of 26
25. (unload-truck s0 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s0)
   goals met: 10 of 26
26. (drive-truck driver6 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 10 of 26
27. (drive-truck driver6 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 10 of 26
28. (load-truck s3 package20 truck1)
   deleted: (at package20 s3)
   added: (in package20 truck1)
   goals met: 10 of 26
29. (unload-truck s3 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s3)
   goals met: 11 of 26
30. (load-truck s3 package15 truck1)
   deleted: (at package15 s3)
   added: (in package15 truck1)
   goals met: 11 of 26
31. (drive-truck driver6 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 11 of 26
32. (unload-truck s2 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s2)
   goals met: 12 of 26
33. (load-truck s2 package11 truck1)
   deleted: (at package11 s2)
   added: (in package11 truck1)
   goals met: 12 of 26
34. (drive-truck driver6 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 12 of 26
35. (load-truck s0 package12 truck1)
   deleted: (at package12 s0)
   added: (in package12 truck1)
   goals met: 12 of 26
36. (unload-truck s0 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s0)
   goals met: 13 of 26
37. (load-truck s0 package10 truck1)
   deleted: (at package10 s0)
   added: (in package10 truck1)
   goals met: 13 of 26
38. (drive-truck driver6 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 13 of 26
39. (unload-truck s4 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s4)
   goals met: 14 of 26
40. (unload-truck s4 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s4)
   goals met: 15 of 26
41. (drive-truck driver6 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 15 of 26
42. (unload-truck s3 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s3)
   goals met: 16 of 26
43. (walk driver3 s0 p0-3)
   deleted: (at driver3 s0)
   added: (at driver3 p0-3)
   goals met: 16 of 26
44. (walk driver3 p0-3 s3)
   deleted: (at driver3 p0-3)
   added: (at driver3 s3)
   goals met: 17 of 26
45. (load-truck s0 package1 truck2)
   deleted: (at package1 s0)
   added: (in package1 truck2)
   goals met: 17 of 26
46. (board-truck driver7 s0 truck2)
   deleted: (at driver7 s0) (empty truck2)
   added: (driving driver7 truck2)
   goals met: 17 of 26
47. (drive-truck driver6 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 17 of 26
48. (unload-truck s1 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   goals met: 18 of 26
49. (load-truck s1 package5 truck1)
   deleted: (at package5 s1)
   added: (in package5 truck1)
   goals met: 18 of 26
50. (drive-truck driver6 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 18 of 26
51. (drive-truck driver6 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 18 of 26
52. (drive-truck driver7 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 17 of 26
53. (unload-truck s4 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s4)
   goals met: 18 of 26
54. (unload-truck s4 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s4)
   goals met: 19 of 26
55. (load-truck s4 package18 truck1)
   deleted: (at package18 s4)
   added: (in package18 truck1)
   goals met: 19 of 26
56. (drive-truck driver6 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 19 of 26
57. (unload-truck s2 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   goals met: 20 of 26
58. (drive-truck driver6 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 20 of 26
59. (unload-truck s3 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s3)
   goals met: 21 of 26
60. (load-truck s1 package16 truck2)
   deleted: (at package16 s1)
   added: (in package16 truck2)
   goals met: 21 of 26
61. (unload-truck s1 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   goals met: 22 of 26
62. (drive-truck driver6 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 22 of 26
63. (unload-truck s1 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 23 of 26
64. (drive-truck driver6 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 23 of 26
65. (drive-truck driver6 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 23 of 26
66. (unload-truck s4 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s4)
   goals met: 24 of 26
67. (drive-truck driver7 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 24 of 26
68. (unload-truck s3 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s3)
   goals met: 25 of 26
69. (drive-truck driver7 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 25 of 26
70. (drive-truck driver7 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 26 of 26
